tutorials/cases/prescribedUsCases/vortexRankine/0.orig/Us
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Prescribed solid velocity. The uniform (0 0 0) here is overwritten by
// setFields / setExprFields; that field is what advects the solid blob.
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(left|right|bottom|top)"
    {
        type            zeroGradient;
    }
    "(front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
