tutorials/cases/prescribedUsCases/vortexRankine/constant/reactions
species
(
    N2
);

reactions
{
}
